src/Documents/ПересчетТоваров/ПересчетТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="852cd565-1094-4515-9352-2ed625a00830">
  <name>ПересчетТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="df3d7680-533f-434a-9646-fcaceedfbcf8">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="67d1d1a0-9e83-4a14-ab8a-949ae4af5f41">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="214b9de4-8523-4160-897e-86cec8115eb0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0cd42549-5c63-4326-a5ab-da4ae709528d">
    <name>ЯчейкаКонсолидацииИзлишковТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1ffbbe09-6f12-4ab5-88f9-37f480b71046">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c7b338c5-33a4-4121-8424-44b0a79bbf06">
    <name>БлокироватьЯчейки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="45f2c666-e47a-4c2b-9a1c-de93847332ae">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e843018a-5fb5-4b9e-b588-a512e8eb2c76">
    <name>ИспользоватьОтдельнуюЯчейкуИзлишков</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a57e8374-03b5-46d5-bab9-2fff11dc7283">
    <name>ИспользоватьОтдельнуюЯчейкуПорчи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06d0fa36-e9a9-4692-af84-b417970b75c6">
    <name>ЯчейкаКонсолидацииИспорченныхТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1d166641-bee3-4d6f-a520-919f77463faf">
    <name>ПечататьКоличествоПоУчету</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8049878f-1356-43c7-bafe-21426949bd39">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="8eab6973-9074-4141-ad3b-d91d6c861d9f">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="7f6ff30a-d9d2-4105-8e02-cd6161d1c70d">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="19c80eb0-2224-4e36-b2ac-dcf1f4a258d0">
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="17ce58d7-d2f2-4855-88c3-b178fdf5994a">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ee420e54-7251-4a5d-9d47-2d68d89d552c">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f5795aea-1b51-494e-8e1b-3f8afb0aa2e5">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9b90b186-075a-4781-a817-9ae0666a8fb7">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0c6c5ccc-fb6b-4038-a94e-93f146f82869">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8da1c3ac-50b6-46c0-87e5-872e21ddca3c">
      <name>КоличествоУпаковокФакт</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/СК_БлокировкаСекций/СК_БлокировкаСекций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СК_БлокировкаСекций</name>
  <resources>
    <name>Блокировка</name>
    <type>
      <types>EnumRef.СК_СтатусыБлокировокСекций</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПересчета</name>
    <type>
      <types>DocumentRef.ПересчетТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СК_Инвентаризация/СК_Инвентаризация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СК_Инвентаризация</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СК_Ячейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПересчета</name>
    <type>
      <types>DocumentRef.ПересчетТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СК_СтатусыБлокировокСекций/СК_СтатусыБлокировокСекций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СК_СтатусыБлокировокСекций</name>
  <enumValues>
    <name>Заблокировано</name>
  </enumValues>
  <enumValues>
    <name>Расчет</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Передано</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПересчетТоваров/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура СК_ЗагрузитьИзТСДВместоНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_Инвентаризация.Номенклатура КАК Номенклатура,
	               |	СК_Инвентаризация.Количество КАК Количество,
	               |	СК_БлокировкаСекций.Секция КАК Секция
	               |ИЗ
	               |	РегистрСведений.СК_БлокировкаСекций КАК СК_БлокировкаСекций
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СК_Инвентаризация КАК СК_Инвентаризация
	               |		ПО СК_БлокировкаСекций.Секция = СК_Инвентаризация.Ячейка.Секция
	               |			И СК_БлокировкаСекций.ДокументПересчета = СК_Инвентаризация.ДокументПересчета
	               |ГДЕ
	               |	СК_БлокировкаСекций.Блокировка = ЗНАЧЕНИЕ(Перечисление.СК_СтатусыБлокировокСекций.Завершено)
	               |	И СК_БлокировкаСекций.ДокументПересчета = &ДокументПересчета";
	Запрос.УстановитьПараметр("ДокументПересчета",Объект.Ссылка);
	Рез = Запрос.Выполнить().Выгрузить(); 
	ТабТовары = Объект.Товары.Выгрузить();
	
	Для Каждого стр из Рез Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",стр.Номенклатура);
		Строки = ТабТовары.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда
			Строки[0].КоличествоФакт = стр.Количество; 
			Строки[0].КоличествоУпаковокФакт = стр.Количество; 
			Строки[0].КоличествоУпаковокОтклонение =  стр.Количество-Строки[0].КоличествоУпаковок;
		Иначе
			Т =  ТабТовары.Добавить();
			Т.Номенклатура = стр.Номенклатура;
			Т.Упаковка =  стр.Номенклатура.ЕдиницаИзмерения; 
			Т.КоличествоУпаковокФакт = стр.Количество;
			Т.КоличествоФакт = стр.Количество;
			Т.КоличествоУпаковокОтклонение =  0 - стр.Количество;
		КонецЕсли;
	КонецЦикла;
	
	Объект.Товары.Очистить();
	Объект.Товары.Загрузить(ТабТовары); 
	
	Рез.Свернуть("Секция");
	
	Для Каждого стр из Рез Цикл
		НаборЗаписей = РегистрыСведений.СК_БлокировкаСекций.СоздатьНаборЗаписей();  			
		НаборЗаписей.Отбор.ДокументПересчета.Установить(Объект.Ссылка);
		НаборЗаписей.Отбор.Секция.Установить(стр.Секция);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 1 Тогда
			НЗапись = НаборЗаписей[0];
			Если НЗапись.Блокировка = Перечисления.СК_СтатусыБлокировокСекций.Завершено Тогда

				НЗапись.Блокировка = Перечисления.СК_СтатусыБлокировокСекций.Передано; 
				НаборЗаписей.Записать();

			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	

КонецПроцедуры

&НаКлиенте
Процедура СК_ЗагрузитьИзТСДВместо(Команда)
	СК_ЗагрузитьИзТСДВместоНаСервере();
КонецПроцедуры
